//给你一个整数 x ，如果 x 是一个回文整数，返回 true ；否则，返回 false 。 
//
// 回文数是指正序（从左向右）和倒序（从右向左）读都是一样的整数。例如，121 是回文，而 123 不是。 
//
// 
//
// 示例 1： 
//
// 
//输入：x = 121
//输出：true
// 
//
// 示例 2： 
//
// 
//输入：x = -121
//输出：false
//解释：从左向右读, 为 -121 。 从右向左读, 为 121- 。因此它不是一个回文数。
// 
//
// 示例 3： 
//
// 
//输入：x = 10
//输出：false
//解释：从右向左读, 为 01 。因此它不是一个回文数。
// 
//
// 示例 4： 
//
// 
//输入：x = -101
//输出：false
// 
//
// 
//
// 提示： 
//
// 
// -231 <= x <= 231 - 1 
// 
//
// 
//
// 进阶：你能不将整数转为字符串来解决这个问题吗？ 
// Related Topics 数学 
// 👍 1405 👎 0


//leetcode submit region begin(Prohibit modification and deletion)

/**
 * 方法1：
 *  如 1221 - >
 *   第一次  x=122  rev = 1
 *   第二次  x=12   rev = 1*10 +2 = 12
 *   当 x <= rev 的时候，就已经 反转一半了
 *
 *   当 x 是偶数的时候 ： 则 x = rev = 12
 *
 *   当 x =121  时
 *   遍历到一半的时候  x = 1  rev = 1 * 10 + 2 = 12
 *   这个时候，需要将中间 对称点的数字排除  rev / 10
 **/
class Solution {

    public boolean isPalindrome(int x) {
        if(x < 0 || (x % 10 == 0 && x != 0 )){
            return false;
        }

        int rev = 0;

        while ( x > rev  ){
           int pop =  x % 10 ;
           x /= 10;
           rev = rev * 10 + pop;
        }

        return rev == x || x == rev/10;
    }

}


/**
 * 方法2
 */
class Solution {
    public boolean isPalindrome(int x) {
        if(x < 0){
            return false;
        }
        int rev = 0;
        int input = x;
        while ( x !=0 ){
            int pop =  x % 10 ;
            x /= 10;

            if (rev > Integer.MAX_VALUE || (rev==Integer.MIN_VALUE && pop > 7)) return false;

            rev = rev * 10 + pop;
        }

        return rev == input;
    }
}
//leetcode submit region end(Prohibit modification and deletion)
